a-container-for-my-dbs/pgsql-nspawn-10.out
sysbench --db-driver=pgsql --pgsql-host=10.0.0.12 --pgsql-user=postgres --pgsql-password= oltp_read_write --threads=10 --time=1200 run --tables=10 --table-size=1000000 --events=0 --delete_inserts=1 --index_updates=1 --secondary=on
sysbench 1.0.16 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            20088978
        write:                           5739593
        other:                           2869909
        total:                           28698480
    transactions:                        1434897 (1195.72 per sec.)
    queries:                             28698480 (23914.92 per sec.)
    ignored errors:                      30     (0.02 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          1200.0221s
    total number of events:              1434897

Latency (ms):
         min:                                    2.65
         avg:                                    8.36
         max:                                 3501.63
         95th percentile:                       10.65
         sum:                             11996464.75

Threads fairness:
    events (avg/stddev):           143489.7000/389.31
    execution time (avg/stddev):   1199.6465/0.01

sysbench --db-driver=pgsql --pgsql-host=10.0.0.12 --pgsql-user=postgres --pgsql-password= oltp_read_write --threads=10 --time=1200 run --tables=10 --table-size=1000000 --events=0 --delete_inserts=1 --index_updates=1 --secondary=on
sysbench 1.0.16 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            20730010
        write:                           5922738
        other:                           2961492
        total:                           29614240
    transactions:                        1480685 (1233.89 per sec.)
    queries:                             29614240 (24678.23 per sec.)
    ignored errors:                      30     (0.02 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          1200.0130s
    total number of events:              1480685

Latency (ms):
         min:                                    2.52
         avg:                                    8.10
         max:                                  854.30
         95th percentile:                       10.65
         sum:                             11996195.22

Threads fairness:
    events (avg/stddev):           148068.5000/227.32
    execution time (avg/stddev):   1199.6195/0.01

sysbench --db-driver=pgsql --pgsql-host=10.0.0.12 --pgsql-user=postgres --pgsql-password= oltp_read_write --threads=10 --time=1200 run --tables=10 --table-size=1000000 --events=0 --delete_inserts=1 --index_updates=1 --secondary=on
sysbench 1.0.16 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            20723486
        write:                           5920888
        other:                           2960558
        total:                           29604932
    transactions:                        1480225 (1233.48 per sec.)
    queries:                             29604932 (24670.04 per sec.)
    ignored errors:                      24     (0.02 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          1200.0342s
    total number of events:              1480225

Latency (ms):
         min:                                    2.66
         avg:                                    8.10
         max:                                  621.20
         95th percentile:                       10.84
         sum:                             11996088.06

Threads fairness:
    events (avg/stddev):           148022.5000/238.56
    execution time (avg/stddev):   1199.6088/0.02