a-container-for-my-dbs/pgsql-rkt-10.out
sysbench --db-driver=pgsql --pgsql-host=127.0.0.1 --pgsql-user=postgres --pgsql-password= oltp_read_write --threads=10 --time=1200 run --tables=10 --table-size=1000000 --events=0 --delete_inserts=1 --index_updates=1 --secondary=on
sysbench 1.0.16 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            19884018
        write:                           5681051
        other:                           2840621
        total:                           28405690
    transactions:                        1420262 (1183.35 per sec.)
    queries:                             28405690 (23667.31 per sec.)
    ignored errors:                      25     (0.02 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          1200.2056s
    total number of events:              1420262

Latency (ms):
         min:                                    2.87
         avg:                                    8.45
         max:                                 1865.27
         95th percentile:                       11.04
         sum:                             11998045.84

Threads fairness:
    events (avg/stddev):           142026.2000/395.58
    execution time (avg/stddev):   1199.8046/0.03

sysbench --db-driver=pgsql --pgsql-host=127.0.0.1 --pgsql-user=postgres --pgsql-password= oltp_read_write --threads=10 --time=1200 run --tables=10 --table-size=1000000 --events=0 --delete_inserts=1 --index_updates=1 --secondary=on
sysbench 1.0.16 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            20215496
        write:                           5775760
        other:                           2887976
        total:                           28879232
    transactions:                        1443940 (1203.26 per sec.)
    queries:                             28879232 (24065.46 per sec.)
    ignored errors:                      24     (0.02 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          1200.0265s
    total number of events:              1443940

Latency (ms):
         min:                                    2.77
         avg:                                    8.31
         max:                                  510.82
         95th percentile:                       11.04
         sum:                             11996465.87

Threads fairness:
    events (avg/stddev):           144394.0000/231.60
    execution time (avg/stddev):   1199.6466/0.01

sysbench --db-driver=pgsql --pgsql-host=127.0.0.1 --pgsql-user=postgres --pgsql-password= oltp_read_write --threads=10 --time=1200 run --tables=10 --table-size=1000000 --events=0 --delete_inserts=1 --index_updates=1 --secondary=on
sysbench 1.0.16 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 10
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            20058626
        write:                           5730909
        other:                           2865587
        total:                           28655122
    transactions:                        1432730 (1193.91 per sec.)
    queries:                             28655122 (23878.57 per sec.)
    ignored errors:                      29     (0.02 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          1200.0336s
    total number of events:              1432730

Latency (ms):
         min:                                    2.71
         avg:                                    8.37
         max:                                  556.00
         95th percentile:                       11.04
         sum:                             11996451.33

Threads fairness:
    events (avg/stddev):           143273.0000/324.11
    execution time (avg/stddev):   1199.6451/0.01